app/views/OWS/Name/InsertGuestCard.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl" xmlns:com="http://webservices.micros.com/og/4.3/Common/">
  <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertGuestCardRequest>
         <name:NameID type="INTERNAL">{NameID}</name:NameID>
         <name:NameMembership>
            <com:membershipType>{membershipType}</com:membershipType>
            <com:membershipNumber>{membershipNumber}</com:membershipNumber>
            <com:memberName>{memberName}</com:memberName>
         </name:NameMembership>
      </name:InsertGuestCardRequest>
   </soapenv:Body>
</soapenv:Envelope>